In [273]:
import pandas as ps

### 1.Quiz.csv파일을 불러오시오

In [274]:
df = ps.read_csv("data/1.Quiz.csv")
df

   경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
0   39060    7313    3627     309     300     B
1   39896    6967    4168    1771     350     B
2   42005    6873    4088    1954     450     A
3   43621    6626    4424    2244     560     A
4   41702    8675    4606    3146    1300     A
5   41266   10622    4984    3945    2395     A
6   32427    9228    5570    5766    3786     C

### index설정

In [275]:
index_list = ["2011", "2012", "2013", "2014", "2015", "2016", "2017"]
df.index = index_list
df

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A
2017   32427    9228    5570    5766    3786     C

### 컬럼들만 추출

In [276]:
df.columns

Index(['경부선KTX', '호남선KTX', '경전선KTX', '전라선KTX', '동해선KTX', '경부선등급'], dtype='object')

### 경부선KTX 열만 조회

In [277]:
df["경부선KTX"]

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

### 경부선KTX, 호남선KTX 컬럼 조회

In [278]:
df[["경부선KTX", "호남선KTX"]]

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

### 인덱싱 사용(loc사용 아님)행기준 조회, 2012~2015년도
### 인덱스 번호를 이용하세요

In [279]:
df[1:5]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

### 행기준 조회, 2012~2015년도
### 해당 인덱스의 이름으로 조회하세요

In [280]:
df['2012':'2015']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

### loc를 이용한 조회

In [281]:
df[["경부선KTX"]]

      경부선KTX
2011   39060
2012   39896
2013   42005
2014   43621
2015   41702
2016   41266
2017   32427

In [282]:
df.loc[df.index == "2011"]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B

In [283]:
df.loc[df.index[2:6]]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A

In [284]:
df.loc[df.index[1:4]][["경부선KTX"]]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [285]:
df["2012":"2014"][["경부선KTX"]]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [286]:
df["2015":"2017"][["경부선KTX","호남선KTX","동해선KTX"]]

      경부선KTX  호남선KTX  동해선KTX
2015   41702    8675    1300
2016   41266   10622    2395
2017   32427    9228    3786

In [287]:
df[df["경부선등급"].isin(['B','C'])]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

In [288]:
df[df["경부선등급"].isin(['B','C'])][["경부선KTX"]]

      경부선KTX
2011   39060
2012   39896
2017   32427